Revit 2024 API
UnitUtils.IsMeasurableSpec Method
 Checks whether a ForgeTypeId identifies a spec associated with units of measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsMeasurableSpec(
	ForgeTypeId specTypeId
)
Visual Basic
Public Shared Function IsMeasurableSpec ( _
	specTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsMeasurableSpec(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier to check.
Return Value
 True if the ForgeTypeId identifies a measurable spec, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace